УчетВУправляющихДляГит1/src/Enums/УПЖКХ_ВариантыЗаполненияТабличнойЧасти/УПЖКХ_ВариантыЗаполненияТабличнойЧасти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УПЖКХ_ВариантыЗаполненияТабличнойЧасти</name>
  <comment>Варианты заполнения табличной части</comment>
  <enumValues>
    <name>Дозаполнение</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнениеСОчисткой</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/CommonForms/УПЖКХ_ВыборВариантаДобавленияДиалог/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Обработчик команды "КомандаДозаполнить".
Процедура КомандаДозаполнить(Команда)
	
	Закрыть(ПредопределенноеЗначение("Перечисление.УПЖКХ_ВариантыЗаполненияТабличнойЧасти.Дозаполнение"));
	
КонецПроцедуры // КомандаДозаполнить()

&НаКлиенте
// Обработчик команды "КомандаЗаполнитьСОчисткой".
Процедура КомандаЗаполнитьСОчисткой(Команда)
	
	Закрыть(ПредопределенноеЗначение("Перечисление.УПЖКХ_ВариантыЗаполненияТабличнойЧасти.ЗаполнениеСОчисткой"));
	
КонецПроцедуры // КомандаЗаполнитьСОчисткой()

&НаКлиенте
// Обработчик команды "КомандаОтмена".
Процедура КомандаОтмена(Команда)
	
	Закрыть(ПредопределенноеЗначение("Перечисление.УПЖКХ_ВариантыЗаполненияТабличнойЧасти.Отмена"));
	
КонецПроцедуры // КомандаОтмена()

#КонецОбласти
